<?xml version="1.0" ?>
<net name="/home/xd/184/intel_install/xdai/deeplearn/yolov5s/weights/PHY_small_light_test_power_pubilc/switch_keypoint" version="10">
	<layers>
		<layer id="0" name="inputs" type="Parameter" version="opset1">
			<data shape="1, 3, 224, 224" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="inputs/scale_copy" type="Const" version="opset1">
			<data element_type="f16" shape="32, 3, 3, 3" offset="0" size="1728"/>
			<output>
				<port id="0" precision="FP16" names="2017">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Conv_0/Dims18905" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="1728" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="2016">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="613">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="2306674552" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1792" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="7" name="2306875074" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="1800" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Slice_12/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16" names="624">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="4" precision="FP16" names="627">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="2029" type="Const" version="opset1">
			<data element_type="f16" shape="16, 1, 1, 3, 3" offset="1816" size="288"/>
			<output>
				<port id="0" precision="FP16" names="2029">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Conv_21/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Conv_21/Dims18707" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="2104" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Conv_21" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="2028">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="2032" type="Const" version="opset1">
			<data element_type="f16" shape="16, 16, 1, 1" offset="2136" size="512"/>
			<output>
				<port id="0" precision="FP16" names="2032">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Conv_22/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Conv_22/Dims18821" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="2648" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Conv_22" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="2031">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Relu_23" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="640">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="2020" type="Const" version="opset1">
			<data element_type="f16" shape="32, 16, 1, 1" offset="2680" size="1024"/>
			<output>
				<port id="0" precision="FP16" names="2020">
					<dim>32</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv_16/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Conv_16/Dims18395" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="3704" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Conv_16" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="2019">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Relu_17" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="630">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="2023" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 3, 3" offset="3768" size="576"/>
			<output>
				<port id="0" precision="FP16" names="2023">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Conv_18/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Conv_18/Dims18107" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="4344" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Conv_18" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="2022">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="2026" type="Const" version="opset1">
			<data element_type="f16" shape="16, 32, 1, 1" offset="4408" size="1024"/>
			<output>
				<port id="0" precision="FP16" names="2026">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv_19/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv_19/Dims18599" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="5432" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_19" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="2025">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Relu_20" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="635">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Concat_24" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="641">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Shape_25" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="642">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_26" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="5464" size="4"/>
			<output>
				<port id="0" precision="I32" names="643"/>
			</output>
		</layer>
		<layer id="35" name="Gather_27/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="5468" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="36" name="Gather_272024" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="644"/>
			</output>
		</layer>
		<layer id="37" name="Unsqueeze_41/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5468" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Unsqueeze_41/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="659">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="2349" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5476" size="8"/>
			<output>
				<port id="0" precision="I64" names="2349">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Shape_28" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="645">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_29" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="5484" size="4"/>
			<output>
				<port id="0" precision="I32" names="646"/>
			</output>
		</layer>
		<layer id="42" name="Gather_30/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="5468" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="43" name="Gather_302114" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="647"/>
			</output>
		</layer>
		<layer id="44" name="Constant_37" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="5476" size="8"/>
			<output>
				<port id="0" precision="I64" names="654"/>
			</output>
		</layer>
		<layer id="45" name="Div_38" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="655,656,657"/>
			</output>
		</layer>
		<layer id="46" name="Unsqueeze_42/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5468" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Unsqueeze_42/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="661">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Shape_31" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="648">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_32" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="5488" size="4"/>
			<output>
				<port id="0" precision="I32" names="649"/>
			</output>
		</layer>
		<layer id="50" name="Gather_33/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="5468" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="51" name="Gather_331960" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="650"/>
			</output>
		</layer>
		<layer id="52" name="Unsqueeze_43/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5468" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Unsqueeze_43/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="662">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Shape_34" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="651">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_35" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="5492" size="4"/>
			<output>
				<port id="0" precision="I32" names="652"/>
			</output>
		</layer>
		<layer id="56" name="Gather_36/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="5468" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="57" name="Gather_362032" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="653"/>
			</output>
		</layer>
		<layer id="58" name="Unsqueeze_44/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5468" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Unsqueeze_44/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="663">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Concat_45" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I64" names="664">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Reshape_46" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="665">
					<dim>1</dim>
					<dim>2</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="1529" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="5496" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Transpose_47" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="666">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Unsqueeze_48/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5468" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Unsqueeze_48/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="668">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="2350" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5536" size="8"/>
			<output>
				<port id="0" precision="I64" names="2350">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Unsqueeze_49/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5468" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Unsqueeze_49/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="670">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Unsqueeze_50/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5468" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Unsqueeze_50/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="671">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Concat_51" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="672">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Reshape_52" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="673">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="2035" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 3, 3" offset="5544" size="576"/>
			<output>
				<port id="0" precision="FP16" names="2035">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_53/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Conv_53/Dims18611" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="6120" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Conv_53" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="2034">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="2038" type="Const" version="opset1">
			<data element_type="f16" shape="16, 32, 3, 3" offset="6184" size="9216"/>
			<output>
				<port id="0" precision="FP16" names="2038">
					<dim>16</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Conv_54/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv_54/Dims18203" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="15400" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv_54" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="2037">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Relu_55" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="678">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="2307173592" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1792" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="83" name="2307374975" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="15432" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Slice_69/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16" names="694">
					<dim>1</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="4" precision="FP16" names="697,713">
					<dim>1</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="AveragePool_89" type="AvgPool" version="opset1">
			<data kernel="2, 2" strides="2, 2" pads_begin="0, 0" pads_end="0, 0" exclude-pad="true" auto_pad="explicit" rounding_type="floor"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="714">
					<dim>1</dim>
					<dim>8</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="2041" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 3, 3" offset="15448" size="576"/>
			<output>
				<port id="0" precision="FP16" names="2041">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Conv_56/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Conv_56/Dims18527" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="16024" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv_56" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="2040">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="2044" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 1, 1" offset="16088" size="2048"/>
			<output>
				<port id="0" precision="FP16" names="2044">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv_57/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Conv_57/Dims18389" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="18136" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Conv_57" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="2043">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Relu_58" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="683">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="2307674360" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1792" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="96" name="2307875230" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="1800" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Slice_83/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16" names="708">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="4" precision="FP16" names="711">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Concat_90" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="715">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="stage0.0.layers.0.cross_resolution_weighting.conv1.0.weight" type="Const" version="opset1">
			<data element_type="f16" shape="3, 24, 1, 1" offset="18200" size="144"/>
			<output>
				<port id="0" precision="FP16" names="stage0.0.layers.0.cross_resolution_weighting.conv1.0.weight">
					<dim>3</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv_91/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>3</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Conv_91/Dims18563" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3, 1, 1" offset="18344" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Conv_91" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="716">
					<dim>1</dim>
					<dim>3</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Relu_92" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="717">
					<dim>1</dim>
					<dim>3</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="stage0.0.layers.0.cross_resolution_weighting.conv2.0.weight" type="Const" version="opset1">
			<data element_type="f16" shape="24, 3, 1, 1" offset="18350" size="144"/>
			<output>
				<port id="0" precision="FP16" names="stage0.0.layers.0.cross_resolution_weighting.conv2.0.weight">
					<dim>24</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Conv_93/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Conv_93/Dims18881" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="18494" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Conv_93" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="718">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Sigmoid_94" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="719">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Split_95/VariadicSplit_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1792" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="110" name="Split_95/VariadicSplit_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="18542" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Split_95/VariadicSplit" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16" names="720">
					<dim>1</dim>
					<dim>8</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="4" precision="FP16" names="721">
					<dim>1</dim>
					<dim>16</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Shape_105" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="731">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Slice_109/Concat2028173730" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5468" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Slice_109/Concat202712028273604" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5476" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Slice_109/Strides2028373829" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1792" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Slice_109" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0" ellipsis_mask="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="735">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Shape_96" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="722">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Constant_97" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="5488" size="4"/>
			<output>
				<port id="0" precision="I32" names="723"/>
			</output>
		</layer>
		<layer id="119" name="Gather_98/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="5468" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="120" name="Gather_981980" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="724"/>
			</output>
		</layer>
		<layer id="121" name="Unsqueeze_102/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5468" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Unsqueeze_102/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="728">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Shape_99" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="725">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Constant_100" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="5492" size="4"/>
			<output>
				<port id="0" precision="I32" names="726"/>
			</output>
		</layer>
		<layer id="125" name="Gather_101/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="5468" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="126" name="Gather_1012070" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="727"/>
			</output>
		</layer>
		<layer id="127" name="Unsqueeze_103/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5468" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Unsqueeze_103/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="729">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Concat_104" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="730,736">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="Concat_111" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="737">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="Resize_114/StridedSlice_sizes_input_port_1/value1400573556" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="5476" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="Resize_114/StridedSlice_sizes_input_port_2/value1400772653" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="18558" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="Resize_114/StridedSlice_sizes_input_port_3/value1400974726" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1792" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="Resize_114/StridedSlice_sizes" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0" ellipsis_mask="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="14025" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
