#!/usr/bin/python3.6
# -*- coding: utf-8 -*-
# @Time    : 2021/11/25 16:22
# @Author  : Qiguangnan
# @File    : chem_allocate_solution_01_conf.py



CPZYDNDDLHNRY01 = {
    'name': '配置一定物质的量浓度的氯化钠溶液(托盘天平、容量瓶)',
    'experimentId': 'CPZYDNDDLHNRY01',
    'isSelect': False,
    'modelPath': 'chem_allocate_solution_01/chem_allocate_solution_01.pt',
    'modelClass': 'CHEM_allocate_solution_01',
    'camUse': ['top', 'front'],
    'imgPath': 'icons/chemistry/weigh_dissolve.png',
    'labelInfo': {
        '手': 0,
        '眼睛': 1,
        '头': 2,
        '抹布': 3,
        '电子天平': 4,
        '电子天平托盘': 5,
        '天平开': 6,
        '天平置零': 7,
        '天平关': 8,
        '天平非零': 9,
        '托盘天平': 10,
        '托盘天平托盘': 11,
        '调平螺母': 12,
        '砝码': 13,
        '砝码盒': 14,
        '砝码镊子': 15,
        '游码': 16,
        '金属块': 17,
        '橡皮': 18,
        '物块': 19,
        '容量瓶': 20,
        '容量瓶刻度线': 21,
        '容量瓶塞': 22,
        '容量瓶肚': 23,
        '广口瓶': 24,
        '细口瓶': 25,
        '细口瓶口': 26,
        '瓶塞未倒放': 27,
        '瓶塞倒放': 28,
        '量筒': 29,
        '量筒底': 30,
        '称量纸': 31,
        '水柱': 32,
        '液体': 33,
        '食盐颗粒': 34,
        '药匙': 35,
        '药匙勺': 36,
        '烧杯': 37,
        '玻璃棒': 38,
        '胶头滴管': 39,
        '桌面水': 40,
        "大理石": 41,
        "木块": 42,
        "酒精灯火焰": 43,
        "酒精灯": 44,
        "酒精灯帽": 45,
        "酒精灯帽摆放错": 46,
        "试管": 47,
        "试管口": 48,
        "试管架": 49,
        "木试管夹": 50,
        "木试管夹头": 51,
        "纸槽": 52,
        "镊子": 53,
        "底座": 54,
        "铁杆": 55,
        "铁圈": 56,
        "铁试管夹": 57,
        "铁试管夹头": 58,
        "石棉网": 59,
        "直角短导气管": 60,
        "直角长导气管": 61,
        "橡胶管": 62,
        "橡皮塞": 63,
        "集气瓶": 64,
        "集气瓶口": 65,
        "毛玻璃片": 66,
        "木条燃烧": 67,
        "木条熄灭": 68,
        "澄清透明试剂": 69,
        "石灰水浑浊": 70,
        "紫色液体": 71,
        "粉红液体": 72,
        "火柴盒": 73,
        "标签": 74,
        '蜡烛燃烧': 75,
        '蜡烛熄灭': 76,
        '滴瓶': 77,
        '气泡反应': 78,
        '预留39': 79,
        '预留40': 80,
        '预留41': 81,
        '预留42': 82,
        '预留43': 83,
        '预留44': 84,
        '预留45': 85,
        '预留46': 86,
        '预留47': 87,
        '预留48': 88,
        '预留49': 89,
        '预留50': 90,
        '预留51': 91,
        '预留52': 92,
        '预留53': 93,
        '预留54': 94,
        '预留55': 95,
        '预留56': 96,
        '预留57': 97,
        '预留58': 98,
        '预留59': 99,
        '预留60': 100,
        '预留61': 101,
        '预留62': 102,
        '预留63': 103,
        '预留64': 104,
        '预留65': 105,
        '预留66': 106,
        '预留67': 107,
        '预留68': 108,
        '预留69': 109,
        '预留70': 110,
        '预留71': 111,
        '预留72': 112,
        '预留73': 113,
        '预留74': 114,
        '预留75': 115,
        '预留76': 116,
        '预留77': 117,
        '预留78': 118,
        '预留79': 119,
        '预留80': 120,
        '预留81': 121,
        '预留82': 122,
        '预留83': 123,
        '预留84': 124,
        '预留85': 125,
        '预留86': 126,
        '预留87': 127
    },
    'scorePointInfo': {
        '1': {
            'info': '托盘天平称量药品操作正确',
            'score': 1
        },
        '2': {
            'info': '加入蒸馏水适量',
            'score': 1
        },
        '3': {
            'info': '搅拌操作正确',
            'score': 1
        },
        '4': {
            'info': '氯化钠完全溶解',
            'score': 1
        },
        '5': {
            'info': '检查容量瓶是否漏水操作正确',
            'score': 1
        },
        '6': {
            'info': '用玻璃棒引流',
            'score': 1
        },
        '7': {
            'info': '洗涤烧杯内壁2-3次，并将洗涤液一并转移到容量瓶中操作正确',
            'score': 1
        },
        '8': {
            'info': '振荡容量瓶操作正确',
            'score': 1
        },
        '9': {
            'info': '使用胶头滴管操作',
            'score': 1
        },
        '10': {
            'info': '定容时视线与刻度线相平',
            'score': 1
        },
        '11': {
            'info': '盖好瓶塞，反复上下颠倒，摇匀',
            'score': 1
        },
        '12': {
            'info': '清洗、整理仪器、药品',
            'score': 1
        }
    },
    'modelInfo': {
        'hand': {
            'index': 0,
            'conf': 0.6,
            'CH_name': '手',
            'max_cn': 2
        },
        'eye': {
            'index': 1,
            'conf': 0.6,
            'CH_name': '眼睛',
            'max_cn': 6
        },
        'head': {
            'index': 2,
            'conf': 0.6,
            'CH_name': '头',
            'max_cn': 4
        },
        'duster': {
            'index': 3,
            'conf': 0.6,
            'CH_name': '抹布',
            'max_cn': 1
        },
        'scale': {
            'index': 10,
            'conf': 0.6,
            'CH_name': '托盘天平',
            'max_cn': 1
        },
        'salver': {
            'index': 11,
            'conf': 0.6,
            'CH_name': '托盘',
            'max_cn': 2
        },
        'nut': {
            'index': 12,
            'conf': 0.5,
            'CH_name': '调平螺母',
            'max_cn': 2
        },
        'ym': {
            'index': 16,
            'conf': 0.6,
            'CH_name': '游码',
            'max_cn': 1
        },
        'rlp': {
            'index': 20,
            'conf': 0.5,
            'CH_name': '容量瓶',
            'max_cn': 1
        },
        'line': {
            'index': 21,
            'conf': 0.5,
            'CH_name': '刻度线',
            'max_cn': 1
        },
        'plug': {
            'index': 22,
            'conf': 0.6,
            'CH_name': '瓶塞',
            'max_cn': 1
        },
        'rlpd': {
            'index': 23,
            'conf': 0.5,
            'CH_name': '瓶肚',
            'max_cn': 1
        },
        'gkp': {
            'index': 24,
            'conf': 0.6,
            'CH_name': '广口瓶',
            'max_cn': 1
        },
        'xkp': {
            'index': 25,
            'conf': 0.5,
            'CH_name': '细口瓶',
            'max_cn': 1
        },
        'xkpk': {
            'index': 26,
            'conf': 0.5,
            'CH_name': '细口瓶口',
            'max_cn': 1
        },
        'pswdf': {
            'index': 27,
            'conf': 0.6,
            'CH_name': '瓶塞未倒放',
            'max_cn': 1
        },
        'psdf': {
            'index': 28,
            'conf': 0.6,
            'CH_name': '瓶塞倒放',
            'max_cn': 1
        },
        'clz': {
            'index': 31,
            'conf': 0.6,
            'CH_name': '称量纸',
            'max_cn': 4
        },
        'column_w': {
            'index': 32,
            'conf': 0.5,
            'CH_name': '水柱',
            'max_cn': 1
        },
        'liquid': {
            'index': 33,
            'conf': 0.5,
            'CH_name': '液体',
            'max_cn': 1
        },
        'nacl': {
            'index': 34,
            'conf': 0.5,
            'CH_name': '食盐颗粒',
            'max_cn': 1
        },
        'spoon': {
            'index': 35,
            'conf': 0.5,
            'CH_name': '药匙',
            'max_cn': 1
        },
        'beaker': {
            'index': 37,
            'conf': 0.5,
            'CH_name': '烧杯',
            'max_cn': 1
        },
        'rod': {
            'index': 38,
            'conf': 0.5,
            'CH_name': '玻璃棒',
            'max_cn': 1
        },
        'dropper': {
            'index': 39,
            'conf': 0.5,
            'CH_name': '胶头滴管',
            'max_cn': 1
        },
    }
}

if __name__ == '__main__':
    print(CPZYDNDDLHNRY01["modelInfo"].keys())