#!/usr/bin/python3.6
# -*- coding: utf-8 -*-
# @Time    : 2022/02/15 16:22
# @Author  : Qiguangnan
# @File    : phy_relationship_M_V_02_conf.py



PTJZLHTJDGX02 = {
    'name': '探究物质质量和体积的关系(电子天平&盐水)',
    'experimentId': 'PTJZLHTJDGX02',
    'isSelect': False,
    'modelPath': 'about_weight/about_weight_2.23.pt',
    'modelClass': 'PHY_relationship_M_V_02',
    'camUse': ['top', 'front'],
    'imgPath': 'icons/chemistry/weigh_dissolve.png',
    'labelInfo': {
        '手': 0,
        '眼睛': 1,
        '头': 2,
        '抹布': 3,
        '电子天平': 4,
        '电子天平托盘': 5,
        '天平开': 6,
        '天平置零': 7,
        '天平关': 8,
        '天平非零': 9,
        '托盘天平': 10,
        '托盘天平托盘': 11,
        '调平螺母': 12,
        '砝码': 13,
        '砝码盒': 14,
        '砝码镊子': 15,
        '游码': 16,
        '金属块': 17,
        '橡皮': 18,
        '物块': 19,
        '容量瓶': 20,
        '容量瓶刻度线': 21,
        '容量瓶塞': 22,
        '容量瓶肚': 23,
        '广口瓶': 24,
        '细口瓶': 25,
        '细口瓶口': 26,
        '瓶塞未倒放': 27,
        '瓶塞倒放': 28,
        '量筒': 29,
        '量筒底': 30,
        '称量纸': 31,
        '水柱': 32,
        '液体': 33,
        '食盐颗粒': 34,
        '药匙': 35,
        '药匙勺': 36,
        '烧杯': 37,
        '玻璃棒': 38,
        '胶头滴管': 39,
        '桌面水': 40,
        "大理石": 41,
        "木块": 42,
        "酒精灯火焰": 43,
        "酒精灯": 44,
        "酒精灯帽": 45,
        "酒精灯帽摆放错": 46,
        "试管": 47,
        "试管口": 48,
        "试管架": 49,
        "木试管夹": 50,
        "木试管夹头": 51,
        "纸槽": 52,
        "镊子": 53,
        "底座": 54,
        "铁杆": 55,
        "铁圈": 56,
        "铁试管夹": 57,
        "铁试管夹头": 58,
        "石棉网": 59,
        "直角短导气管": 60,
        "直角长导气管": 61,
        "橡胶管": 62,
        "橡皮塞": 63,
        "集气瓶": 64,
        "集气瓶口": 65,
        "毛玻璃片": 66,
        "木条燃烧": 67,
        "木条熄灭": 68,
        "澄清透明试剂": 69,
        "石灰水浑浊": 70,
        "紫色液体": 71,
        "粉红液体": 72,
        "火柴盒": 73,
        "标签": 74,
        '蜡烛燃烧': 75,
        '蜡烛熄灭': 76,
        '滴瓶': 77,
        '气泡反应': 78,
        '预留39': 79,
        '预留40': 80,
        '预留41': 81,
        '预留42': 82,
        '预留43': 83,
        '预留44': 84,
        '预留45': 85,
        '预留46': 86,
        '预留47': 87,
        '预留48': 88,
        '预留49': 89,
        '预留50': 90,
        '预留51': 91,
        '预留52': 92,
        '预留53': 93,
        '预留54': 94,
        '预留55': 95,
        '预留56': 96,
        '预留57': 97,
        '预留58': 98,
        '预留59': 99,
        '预留60': 100,
        '预留61': 101,
        '预留62': 102,
        '预留63': 103,
        '预留64': 104,
        '预留65': 105,
        '预留66': 106,
        '预留67': 107,
        '预留68': 108,
        '预留69': 109,
        '预留70': 110,
        '预留71': 111,
        '预留72': 112,
        '预留73': 113,
        '预留74': 114,
        '预留75': 115,
        '预留76': 116,
        '预留77': 117,
        '预留78': 118,
        '预留79': 119,
        '预留80': 120,
        '预留81': 121,
        '预留82': 122,
        '预留83': 123,
        '预留84': 124,
        '预留85': 125,
        '预留86': 126,
        '预留87': 127
    },
    'scorePointInfo': {
        '1': {
            'info': '将量筒置于电子天平中央，完成电子天平"清零"操作',
            'score': 1
        },
        '2': {
            'info': '取下量筒，倒入适当的盐水，观察并记录量筒中液面对应的示数',
            'score': 1
        },
        '3': {
            'info': '再将量筒置于电子天平中央，记录电子天平的示数',
            'score': 1
        },
        '4': {
            'info': '取下量筒，改变盐水的体积，观察并记录量筒中液面对应的示数',
            'score': 1
        },
        '5': {
            'info': '再将量筒置于电子天平中央，记录电子天平的示数',
            'score': 1
        },
        '6': {
            'info': '整理实验器材',
            'score': 1
        }
    },
    'modelInfo': {
        'hand': {
            'index': 0,
            'conf': 0.5,
            'CH_name': '手',
            'max_cn': 4
        },
        'eye': {
            'index': 1,
            'conf': 0.5,
            'CH_name': '眼睛',
            'max_cn': 6
        },
        'head': {
            'index': 2,
            'conf': 0.5,
            'CH_name': '头',
            'max_cn': 4
        },
        'duster': {
            'index': 3,
            'conf': 0.6,
            'CH_name': '抹布',
            'max_cn': 1
        },
        'scale': {
            'index': 4,
            'conf': 0.7,
            'CH_name': '电子天平',
            'max_cn': 1
        },
        'salver': {
            'index': 5,
            'conf': 0.7,
            'CH_name': '托盘',
            'max_cn': 1
        },
        'scale_on': {
            'index': 6,
            'conf': 0.6,
            'CH_name': '天平开',
            'max_cn': 1
        },
        'scale_zero': {
            'index': 7,
            'conf': 0.6,
            'CH_name': '天平置零',
            'max_cn': 1
        },
        'scale_off': {
            'index': 8,
            'conf': 0.6,
            'CH_name': '天平关',
            'max_cn': 1
        },
        'scale_not_zero': {
            'index': 9,
            'conf': 0.6,
            'CH_name': '天平非零',
            'max_cn': 1
        },
        'measuring_cylinder': {
            'index': 29,
            'conf': 0.7,
            'CH_name': '量筒',
            'max_cn': 1
        },
        'measuring_cylinder_bottom': {
            'index': 30,
            'conf': 0.6,
            'CH_name': '量筒底',
            'max_cn': 1
        },
        'water_column': {
            'index': 32,
            'conf': 0.6,
            'CH_name': '水柱',
            'max_cn': 1
        },
        'liquid': {
            'index': 33,
            'conf': 0.6,
            'CH_name': '液体',
            'max_cn': 1
        },
        'beaker': {
            'index': 37,
            'conf': 0.6,
            'CH_name': '烧杯',
            'max_cn': 1
        }
    }
}
